[
  {
    "title": "Mario Strikers: Battle League post-launch updates confirmed, including new characters",
    "author": "Nintendo",
    "content": "Nintendo has confirmed that Mario Strikers: Battle League will be receiving new updates after launch. As part of this, fans can look forward to additional characters. Specifics havent been shared just yet though, but we know that the updates will be entirely free. Providing updates after release is a familiar move for Nintendo, especially when it comes to sports games on Switch. With Mario Tennis Aces for example, the game added Koopa Troopa, Blooper, Diddy Kong, Birdo, Shy Guy, Petey Piranha, Luma, Boom Boom, Pauline, Kamek, Dry Bones, Fire Piranha Plant, and Dry Bowser after launch. Meanwhile, we saw Toadette, Ninji, Koopa Troopa, Wiggler, and Shy Guy in Mario Golf: Super Rush after release. Fans have been pretty vocal about the roster in Mario Strikers: Battle League, including their desire to see characters such as Daisy. With the updates coming after the game’s debut, these wishes will be fulfilled.",
    "dateCreated": "2022-05-05T16:55:12.725Z",
    "color": "blue",
    "collectionNamecollection": "nocollection"
  },
  {
    "title": "Pokémon Scarlet And Violet Will Get A Brand New Trailer Tomorrow",
    "author": "Nintendo",
    "content": "Lot of fans will be eager to see more of the Switch's latest Pokémon game after The Pokémon Company announced the new region would be 'a richly expressed open world'. We'll be sure to update you as soon as the news drops tomorrow, but for now, catch up on everything we know so far, including a more detailed look at the starter trio and six things we want to see from the new entries.",
    "dateCreated": "2020-10-08T16:55:12.725Z",
    "color": "red",
    "collectionName": "nocollection"
  },
  {
    "title": "The Power Glove Is An Inventive Way To Play Mario Kart Live: Home Circuit",
    "author": "Nintendo",
    "content": "The Power Glove wasn't great. We know it, you know it, everyone knows it. It's infamous for being one of the worst controllers ever. Yet that doesn't stop people from being fascinated with it and trying new things out with the peripheral.",
    "dateCreated": "2020-10-08T16:55:12.725Z",
    "color": "green",
    "collectionName": "nocollection"
  },
  {
    "title": "Souldiers launch trailer",
    "author": "Nintendo",
    "content": "While out fighting for the glory of their kingdom, you and your fellow soldiers are whisked away to Terragaya, a mystical land on the fringes of the afterlife. Your task is to locate the Guardian and move on to the next world. The hitch? You and your compatriots never actually died.",
    "dateCreated": "2020-10-08T16:55:12.725Z",
    "color": "violet",
    "collectionName": "nocollection"
  },


  {
    "title": "A closer look at the chaotic, compelling gameplay of SpiderHeck",
    "author": "PlayStation",
    "content": "Hello, Heckstars! It’s Sergey from tinyBuild here, and today I’m incredibly excited to tell you more about our upcoming fast-paced, physics-based, couch multiplayer brawler SpiderHeck. So, how can I describe SpiderHeck to you? In all honesty, it’s so epic, it’s unexplainable. You need to play it for yourself to get where I’m coming from. Because if you put seven-legged spiders (does it make them spiders in this case?), particle blades, laser blasters, rocket launchers, lots of enemies and your friends together, and top that with the physic-based environments and battle mechanics, mind blowing web slinging parkour moves and close calls – that sounds like a crazy hectic game. But its the chaos that makes SpiderHeck so much fun! As the saying goes – a picture is worth a thousand words, so check out the new gameplay trailer below.",
    "dateCreated": "2022-08-02T16:55:12.725Z",
    "color": "aqua",
    "collectionName": "nocollection"
  },
  {
    "title": "DreamsCom returns starting May 26",
    "author": "PlayStation",
    "content": "Hey there! Tom from Media Molecule here, who’s very happy to announce the return of Dreams’ annual virtual exhibition show: DreamsCom. An event that puts the Dreams Community front and center, giving everyone in the Dreamiverse a chance to showcase who they are in Dreams from game developers to music makers to streamers to film makers and everything in between.",
    "dateCreated": "2022-08-02T16:55:12.725Z",
    "color": "brown",
    "collectionName": "nocollection"
  },
  {
    "title": "How Behind the Frame’s animation makes you feel at home",
    "author": "PlayStation",
    "content": "Most games you’ll find featured in Game of the Year lists revolve around fantasy, larger-than-life stakes, the far future, or distant past. These are places that want to transport players to completely different worlds, new experiences unlike anything you’ve ever had before. Behind the Frame: The Finest Scenery, which releases for the PlayStation 4 on June 2, has its sights set on a different fantasy – one in which you can sink into the delightful routines of everyday life.",
    "dateCreated": "2022-08-02T16:55:12.725Z",
    "color": "teal",
    "collectionName": "nocollection"
  },
  {
    "title": "Bungie’s Destiny historian prepares you for Destiny 2’s Season of the Haunted, live now",
    "author": "PlayStation",
    "content": "Today marks the beginning of Season of the Haunted, a new chapter in the ongoing story of Destiny 2. New players and veteran Guardians alike are heeding the call as a returning threat has suddenly emerged in our galaxy. It is in this new Season that we find references to tragic conspiracies, relatable familial strife, and the unwavering desire—no, the need—to party like it’s the end of the universe. ",
    "dateCreated": "2022-08-02T16:55:12.725Z",
    "color": "coral",
    "collectionName": "nocollection"
  },
  {
    "title": "Puzzle-adventure game A Monster’s Expedition hits PS5 & PS4 today",
    "author": "PlayStation",
    "content": "Hello PlayStation Blog readers! We’re thrilled to bring you the news today that A Monster’s Expedition, the award-winning, open-world puzzle game, is available today for PlayStation 4 and PlayStation 5. In A Monster’s Expedition you play the role of the titular Monster, exploring an archipelago museum. Knock down trees and solve puzzles to move from island to island, and explore the hilarious Museum of Human Englandland, made by Monsterkind who only vaguely understands humanity.",
    "dateCreated": "2022-08-02T16:55:12.725Z",
    "color": "crimson",
    "collection": "nocollection"
  },


  {
    "title": "Determine the Destiny of Golden Sands Outpost in Sea of Thieves’ New Adventure Lost Sands",
    "author": "Xbox",
    "content": "The fate of Golden Sands Outpost hangs in the balance in Sea of Thieves’ fourth time-limited Adventure, Lost Sands. In a departure from previous Adventures, players can pick the path they wish to follow, either choosing to aid in the Outpost’s reconstruction or dooming it to be ever shrouded in ethereal mist. The side with the most support at the end of the Adventure will determine the future of Golden Sands in Sea of Thieves, so weigh your options carefully! Do you want the Outpost restored to its previous prominence, or would you rather leave it in ruins as a tactical play or a testament to Captain Flameheart’s power? As with previous Adventures, players have been given a glimpse of the current state of play in the cinematic opening trailer.",
    "dateCreated": "2022-01-01T16:55:12.725Z",
    "color": "darkcyan",
    "collectionName": "nocollection"
  },
  {
    "title": "3D Platformer Kao the Kangaroo Jumps onto Xbox This Summer!",
    "author": "Xbox",
    "content": "With over 21 years of history to build on, the latest entry into the Kao, The Kangaroo series is the most ambitious, and mysterious, yet! Our plucky marsupial is back in a whole new adventure! This love-letter to 3D platformers will see Kao seek the truth behind his father’s disappearance and uncover the secrets behind the recently discovered magical boxing gloves. The mysteries only deepen as unknown purple crystals begin to appear around the world, changing the lands and creatures around them. Portals open, giving a glimpse at a realm hidden behind reality, an ancient world, a powerful world… the Eternal world. What secrets does this world hold? Why is it bleeding through into Kao’s reality? Does it hold the truth behind Kao’s father’s disappearance? All of the questions need answers and it’s time to find them! Set in a vibrant world filled with colourful characters, Kao The Kangaroo is the complete 3D platforming adventure that ties together old-school elements with new school ways. An accessible experience that offers fun for all, whether you’re a 100% collect-a-thon master, a lighting-fast speedrunner or a few hours a week warrior, there’s something for everyone!",
    "dateCreated": "2022-01-01T16:55:12.725Z",
    "color": "darkgoldenrod",
    "collectionName": "nocollection"
  },
  {
    "title": "Rappy 1st Anniversary, Phantasy Star Online 2 New Genesis",
    "author": "Xbox",
    "content": "So, I think if asked to, I can finally pronounce the name of the Weapon Series (Kukuhroziat) best-suited for running the newly introduced Geometric Labyrinth in PSO2 NGS (I did have to look up the spelling, however.) Fortunately, the PSO2 NGS First Anniversary Event, which started May 11, brings a new Elemental Weapon Series that is much easier to say (and spell) – the Obscura Weapon Series. Weapons from this series will drop in the new Limited-time Quest Drill: Dazzling Chaos Suppression Op and can be exchanged for Seasonal Points at the Seasonal Points Exchange Shop, which will be staffed by Xitre, as she has returned from her vacation. The Anniversary Event also includes changes to the décor of Retem and Central City, possible sightings of the Anni Rappy, and additional gathering materials in the form of Annivesartichoke and Randomite. What is most exciting for me, however, is the introduction of new Trials in all Sectors that feature a new enemy – Captan. This enemy reminds me of a rare enemy that I occasionally encountered in PSO2, Mesetan, which dropped oodles of Meseta.",
    "dateCreated": "2022-01-01T16:55:12.725Z",
    "color": "indigo",
    "collectionName": "nocollection"
  },
  {
    "title": "Moo Lander – the World’s First Mootroidvania, Drops on Xbox Today",
    "author": "Xbox",
    "content": "Bulgaria is home to 230 thousand cows and around 6.9 million humans, which means roughly every 30 people get a cow. The cow that’s been living at The Sixth Hammer studios has been demanding a game since the co-creators first discovered what a cow actually is. Well, we are very pleased to announce that Moo Lander is out and available for Xbox One, now! Moo Lander is all about the milk! Embark on an epic quest to save your dying civilization – tame Mighty Cow bosses, uncover ancient secrets and fight hordes of enemies with a powerful milk arsenal. Enjoy a four-player local multiplayer with four different gameplay modes. In the mooltiverse of Moo Lander, milk reigns as the supreme energy source, possessing a power second only to the stellar explosions of a super nova. Trouble is, it’s rapidly becoming scarce. The steaks – er, stakes – for your civilization are high, but rumors of an ancient device capable of producing infinite quantities of milk have reached your ears. After hoofing it to the only functioning spacecraft your civilization has left, you set out to a gorgeous, handcrafted world full of deadly life-forms and ancient bovine foes.",
    "dateCreated": "2022-01-01T16:55:12.725Z",
    "color": "mediumseagreen",
    "collectionName": "nocollection"
  }
]